bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128A1.xml
                <instance name="PORTC">
                    <register-group address-space="data" offset="0x0640" name-in-module="PORT" name="PORTC"/>
                    <signals>
                        <signal function="PORTC" group="P" index="0" pad="PC0"/>
                        <signal function="PORTC" group="P" index="1" pad="PC1"/>
                        <signal function="PORTC" group="P" index="2" pad="PC2"/>
                        <signal function="PORTC" group="P" index="3" pad="PC3"/>
                        <signal function="PORTC" group="P" index="4" pad="PC4"/>
                        <signal function="PORTC" group="P" index="5" pad="PC5"/>
                        <signal function="PORTC" group="P" index="6" pad="PC6"/>
                        <signal function="PORTC" group="P" index="7" pad="PC7"/>
                    </signals>
                </instance>
                <instance name="PORTD">
                    <register-group address-space="data" offset="0x0660" name-in-module="PORT" name="PORTD"/>
                    <signals>
                        <signal function="PORTD" group="P" index="0" pad="PD0"/>
                        <signal function="PORTD" group="P" index="1" pad="PD1"/>
                        <signal function="PORTD" group="P" index="2" pad="PD2"/>
                        <signal function="PORTD" group="P" index="3" pad="PD3"/>
                        <signal function="PORTD" group="P" index="4" pad="PD4"/>
                        <signal function="PORTD" group="P" index="5" pad="PD5"/>
                        <signal function="PORTD" group="P" index="6" pad="PD6"/>
                        <signal function="PORTD" group="P" index="7" pad="PD7"/>
                    </signals>
                </instance>
                <instance name="PORTE">
                    <register-group address-space="data" offset="0x0680" name-in-module="PORT" name="PORTE"/>
                    <signals>
                        <signal function="PORTE" group="P" index="0" pad="PE0"/>
                        <signal function="PORTE" group="P" index="1" pad="PE1"/>
                        <signal function="PORTE" group="P" index="2" pad="PE2"/>
                        <signal function="PORTE" group="P" index="3" pad="PE3"/>
                        <signal function="PORTE" group="P" index="4" pad="PE4"/>
                        <signal function="PORTE" group="P" index="5" pad="PE5"/>
                        <signal function="PORTE" group="P" index="6" pad="PE6"/>
                        <signal function="PORTE" group="P" index="7" pad="PE7"/>
                    </signals>
                </instance>
                <instance name="PORTF">
                    <register-group address-space="data" offset="0x06A0" name-in-module="PORT" name="PORTF"/>
                    <signals>
                        <signal function="PORTF" group="P" index="0" pad="PF0"/>
                        <signal function="PORTF" group="P" index="1" pad="PF1"/>
                        <signal function="PORTF" group="P" index="2" pad="PF2"/>
                        <signal function="PORTF" group="P" index="3" pad="PF3"/>
                        <signal function="PORTF" group="P" index="4" pad="PF4"/>
                        <signal function="PORTF" group="P" index="5" pad="PF5"/>
                        <signal function="PORTF" group="P" index="6" pad="PF6"/>
                        <signal function="PORTF" group="P" index="7" pad="PF7"/>
                    </signals>
                </instance>
                <instance name="PORTH">
                    <register-group address-space="data" offset="0x06E0" name-in-module="PORT" name="PORTH"/>
                    <signals>
                        <signal function="PORTH" group="P" index="0" pad="PH0"/>
                        <signal function="PORTH" group="P" index="1" pad="PH1"/>
                        <signal function="PORTH" group="P" index="2" pad="PH2"/>
                        <signal function="PORTH" group="P" index="3" pad="PH3"/>
                        <signal function="PORTH" group="P" index="4" pad="PH4"/>
                        <signal function="PORTH" group="P" index="5" pad="PH5"/>
                        <signal function="PORTH" group="P" index="6" pad="PH6"/>
                        <signal function="PORTH" group="P" index="7" pad="PH7"/>
                    </signals>
                </instance>
                <instance name="PORTJ">
                    <register-group address-space="data" offset="0x0700" name-in-module="PORT" name="PORTJ"/>
                    <signals>
                        <signal function="PORTJ" group="P" index="0" pad="PJ0"/>
                        <signal function="PORTJ" group="P" index="1" pad="PJ1"/>
                        <signal function="PORTJ" group="P" index="2" pad="PJ2"/>
                        <signal function="PORTJ" group="P" index="3" pad="PJ3"/>
                        <signal function="PORTJ" group="P" index="4" pad="PJ4"/>
                        <signal function="PORTJ" group="P" index="5" pad="PJ5"/>
                        <signal function="PORTJ" group="P" index="6" pad="PJ6"/>
                        <signal function="PORTJ" group="P" index="7" pad="PJ7"/>
                    </signals>
                </instance>
                <instance name="PORTK">
                    <register-group address-space="data" offset="0x0720" name-in-module="PORT" name="PORTK"/>
                    <signals>
                        <signal function="PORTK" group="P" index="0" pad="PK0"/>
                        <signal function="PORTK" group="P" index="1" pad="PK1"/>
                        <signal function="PORTK" group="P" index="2" pad="PK2"/>
                        <signal function="PORTK" group="P" index="3" pad="PK3"/>
                        <signal function="PORTK" group="P" index="4" pad="PK4"/>
                        <signal function="PORTK" group="P" index="5" pad="PK5"/>
                        <signal function="PORTK" group="P" index="6" pad="PK6"/>
                        <signal function="PORTK" group="P" index="7" pad="PK7"/>
                    </signals>
                </instance>
                <instance name="PORTQ">
                    <register-group address-space="data" offset="0x07C0" name-in-module="PORT" name="PORTQ"/>
                    <signals>
                        <signal function="PORTQ" group="P" index="0" pad="PQ0"/>
                        <signal function="PORTQ" group="P" index="1" pad="PQ1"/>
                        <signal function="PORTQ" group="P" index="2" pad="PQ2"/>
                        <signal function="PORTQ" group="P" index="3" pad="PQ3"/>
                    </signals>
                </instance>
                <instance name="PORTR">
                    <register-group address-space="data" offset="0x07E0" name-in-module="PORT" name="PORTR"/>
                    <signals>
                        <signal function="PORTR" group="P" index="0" pad="PR0"/>
                        <signal function="PORTR" group="P" index="1" pad="PR1"/>
                    </signals>
                </instance>
            </module>
