bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128A1.xml
            <module name="TC" id="I6090">
                <instance name="TCC0">
                    <register-group address-space="data" offset="0x800" name-in-module="TC0" name="TCC0"/>
                </instance>
                <instance name="TCC1">
                    <register-group address-space="data" offset="0x840" name-in-module="TC1" name="TCC1"/>
                </instance>
                <instance name="AWEXC">
                    <register-group address-space="data" offset="0x880" name-in-module="AWEX" name="AWEXC"/>
                </instance>
                <instance name="HIRESC">
                    <register-group address-space="data" offset="0x890" name-in-module="HIRES" name="HIRESC"/>
                </instance>
                <instance name="TCD0">
                    <register-group address-space="data" offset="0x900" name-in-module="TC0" name="TCD0"/>
                </instance>
                <instance name="TCD1">
                    <register-group address-space="data" offset="0x940" name-in-module="TC1" name="TCD1"/>
                </instance>
                <instance name="HIRESD">
                    <register-group address-space="data" offset="0x990" name-in-module="HIRES" name="HIRESD"/>
                </instance>
                <instance name="TCE0">
                    <register-group address-space="data" offset="0xA00" name-in-module="TC0" name="TCE0"/>
                </instance>
                <instance name="TCE1">
                    <register-group address-space="data" offset="0xA40" name-in-module="TC1" name="TCE1"/>
                </instance>
                <instance name="AWEXE">
                    <register-group address-space="data" offset="0xA80" name-in-module="AWEX" name="AWEXE"/>
                </instance>
                <instance name="HIRESE">
                    <register-group address-space="data" offset="0xA90" name-in-module="HIRES" name="HIRESE"/>
                </instance>
                <instance name="TCF0">
                    <register-group address-space="data" offset="0xB00" name-in-module="TC0" name="TCF0"/>
                </instance>
                <instance name="TCF1">
                    <register-group address-space="data" offset="0xB40" name-in-module="TC1" name="TCF1"/>
                </instance>
                <instance name="HIRESF">
                    <register-group address-space="data" offset="0xB90" name-in-module="HIRES" name="HIRESF"/>
                </instance>
            </module>
            <module name="USART" id="I6090">
                <instance name="USARTC0">
                    <register-group address-space="data" offset="0x8A0" name-in-module="USART" name="USARTC0"/>
                </instance>
                <instance name="USARTC1">
                    <register-group address-space="data" offset="0x8B0" name-in-module="USART" name="USARTC1"/>
                </instance>
                <instance name="USARTD0">
                    <register-group address-space="data" offset="0x9A0" name-in-module="USART" name="USARTD0"/>
                </instance>
                <instance name="USARTD1">
                    <register-group address-space="data" offset="0x9B0" name-in-module="USART" name="USARTD1"/>
                </instance>
                <instance name="USARTE0">
                    <register-group address-space="data" offset="0xAA0" name-in-module="USART" name="USARTE0"/>
                </instance>
                <instance name="USARTE1">
                    <register-group address-space="data" offset="0xAB0" name-in-module="USART" name="USARTE1"/>
                </instance>
                <instance name="USARTF0">
                    <register-group address-space="data" offset="0xBA0" name-in-module="USART" name="USARTF0"/>
                </instance>
                <instance name="USARTF1">
                    <register-group address-space="data" offset="0xBB0" name-in-module="USART" name="USARTF1"/>
                </instance>
            </module>
            <module name="SPI" id="I6090">
                <instance name="SPIC">
                    <register-group address-space="data" offset="0x8C0" name-in-module="SPI" name="SPIC"/>
                </instance>
                <instance name="SPID">
                    <register-group address-space="data" offset="0x9C0" name-in-module="SPI" name="SPID"/>
                </instance>
                <instance name="SPIE">
                    <register-group address-space="data" offset="0xAC0" name-in-module="SPI" name="SPIE"/>
                </instance>
                <instance name="SPIF">
                    <register-group address-space="data" offset="0xBC0" name-in-module="SPI" name="SPIF"/>
                </instance>
            </module>
            <module name="IRCOM" id="I6090">
                <instance name="IRCOM">
                    <register-group address-space="data" offset="0x8F8" name-in-module="IRCOM" name="IRCOM"/>
                </instance>
            </module>
            <module name="AES" id="I6096">
                <instance name="AES">
                    <register-group address-space="data" offset="0x0C0" name-in-module="AES" name="AES"/>
                </instance>
            </module>
        </peripherals>
        <interrupts>
            <interrupt-group index="1" module-instance="OSC" name-in-module="OSC"/>
            <interrupt-group index="2" module-instance="PORTC" name-in-module="PORT"/>
            <interrupt-group index="4" module-instance="PORTR" name-in-module="PORT"/>
            <interrupt-group index="6" module-instance="DMA" name-in-module="DMA"/>
            <interrupt-group index="10" module-instance="RTC" name-in-module="RTC"/>
            <interrupt-group index="12" module-instance="TWIC" name-in-module="TWI"/>
            <interrupt-group index="14" module-instance="TCC0" name-in-module="TC0"/>
            <interrupt-group index="20" module-instance="TCC1" name-in-module="TC1"/>
            <interrupt-group index="24" module-instance="SPIC" name-in-module="SPI"/>
            <interrupt-group index="25" module-instance="USARTC0" name-in-module="USART"/>
            <interrupt-group index="28" module-instance="USARTC1" name-in-module="USART"/>
            <interrupt-group index="31" module-instance="AES" name-in-module="AES"/>
            <interrupt-group index="32" module-instance="NVM" name-in-module="NVM"/>
            <interrupt-group index="34" module-instance="PORTB" name-in-module="PORT"/>
            <interrupt-group index="36" module-instance="ACB" name-in-module="AC"/>
            <interrupt-group index="39" module-instance="ADCB" name-in-module="ADC"/>
            <interrupt-group index="43" module-instance="PORTE" name-in-module="PORT"/>
            <interrupt-group index="45" module-instance="TWIE" name-in-module="TWI"/>
            <interrupt-group index="47" module-instance="TCE0" name-in-module="TC0"/>
            <interrupt-group index="53" module-instance="TCE1" name-in-module="TC1"/>
            <interrupt-group index="57" module-instance="SPIE" name-in-module="SPI"/>
            <interrupt-group index="58" module-instance="USARTE0" name-in-module="USART"/>
            <interrupt-group index="61" module-instance="USARTE1" name-in-module="USART"/>
            <interrupt-group index="64" module-instance="PORTD" name-in-module="PORT"/>
            <interrupt-group index="66" module-instance="PORTA" name-in-module="PORT"/>
            <interrupt-group index="68" module-instance="ACA" name-in-module="AC"/>
            <interrupt-group index="71" module-instance="ADCA" name-in-module="ADC"/>
            <interrupt-group index="75" module-instance="TWID" name-in-module="TWI"/>
            <interrupt-group index="77" module-instance="TCD0" name-in-module="TC0"/>
            <interrupt-group index="83" module-instance="TCD1" name-in-module="TC1"/>
            <interrupt-group index="87" module-instance="SPID" name-in-module="SPI"/>
            <interrupt-group index="88" module-instance="USARTD0" name-in-module="USART"/>
            <interrupt-group index="91" module-instance="USARTD1" name-in-module="USART"/>
            <interrupt-group index="94" module-instance="PORTQ" name-in-module="PORT"/>
            <interrupt-group index="96" module-instance="PORTH" name-in-module="PORT"/>
            <interrupt-group index="98" module-instance="PORTJ" name-in-module="PORT"/>
            <interrupt-group index="100" module-instance="PORTK" name-in-module="PORT"/>
            <interrupt-group index="104" module-instance="PORTF" name-in-module="PORT"/>
            <interrupt-group index="106" module-instance="TWIF" name-in-module="TWI"/>
            <interrupt-group index="108" module-instance="TCF0" name-in-module="TC0"/>
            <interrupt-group index="114" module-instance="TCF1" name-in-module="TC1"/>
            <interrupt-group index="118" module-instance="SPIF" name-in-module="SPI"/>
            <interrupt-group index="119" module-instance="USARTF0" name-in-module="USART"/>
            <interrupt-group index="122" module-instance="USARTF1" name-in-module="USART"/>
        </interrupts>
        <interfaces>
            <interface type="pdi" name="PDI"/>
            <interface type="xmegajtag" name="JTAG"/>
        </interfaces>
        <property-groups>
            <property-group name="SIGNATURES">
                <property name="JTAGID" value="0x0974C03F"/>
                <property name="SIGNATURE0" value="0x1E"/>
                <property name="SIGNATURE1" value="0x97"/>
                <property name="SIGNATURE2" value="0x4C"/>
            </property-group>
            <property-group name="PDI_INTERFACE">
                <property name="APP_SECTION_OFFSET" value="0x00800000"/>
                <property name="APPTABLE_SECTION_OFFSET" value="0x0081E000"/>
                <property name="BOOT_SECTION_OFFSET" value="0x00820000"/>
                <property name="DATAMEM_OFFSET" value="0x01000000"/>
                <property name="EEPROM_OFFSET" value="0x008C0000"/>
                <property name="USER_SIGNATURES_OFFSET" value="0x008E0400"/>
                <property name="PROD_SIGNATURES_OFFSET" value="0x008E0200"/>
                <property name="FUSE_REGISTERS_OFFSET" value="0x008F0020"/>
                <property name="LOCK_REGISTERS_OFFSET" value="0x008F0027"/>
            </property-group>
        </property-groups>
    </device>
    <modules>
        <module name="GPIO" id="I6085" caption="General Purpose IO">
            <register-group caption="General Purpose IO Registers" name="GPIO" size="16">
                <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x00" size="1"/>
                <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x01" size="1"/>
