bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128A1.xml
            <value-group caption="Event channel selection" name="DAC_EVSEL">
                <value caption="Event Channel 0" name="0" value="0x00"/>
                <value caption="Event Channel 1" name="1" value="0x01"/>
                <value caption="Event Channel 2" name="2" value="0x02"/>
                <value caption="Event Channel 3" name="3" value="0x03"/>
                <value caption="Event Channel 4" name="4" value="0x04"/>
                <value caption="Event Channel 5" name="5" value="0x05"/>
                <value caption="Event Channel 6" name="6" value="0x06"/>
                <value caption="Event Channel 7" name="7" value="0x07"/>
            </value-group>
            <value-group caption="Conversion interval" name="DAC_CONINTVAL">
                <value caption="1 CLK / 2 CLK in S/H mode" name="1CLK" value="0x00"/>
                <value caption="2 CLK / 3 CLK in S/H mode" name="2CLK" value="0x01"/>
                <value caption="4 CLK / 6 CLK in S/H mode" name="4CLK" value="0x02"/>
                <value caption="8 CLK / 12 CLK in S/H mode" name="8CLK" value="0x03"/>
                <value caption="16 CLK / 24 CLK in S/H mode" name="16CLK" value="0x04"/>
                <value caption="32 CLK / 48 CLK in S/H mode" name="32CLK" value="0x05"/>
                <value caption="64 CLK / 96 CLK in S/H mode" name="64CLK" value="0x06"/>
                <value caption="128 CLK / 192 CLK in S/H mode" name="128CLK" value="0x07"/>
            </value-group>
            <value-group caption="Refresh rate" name="DAC_REFRESH">
                <value caption="16 CLK" name="16CLK" value="0x00"/>
                <value caption="32 CLK" name="32CLK" value="0x01"/>
                <value caption="64 CLK" name="64CLK" value="0x02"/>
                <value caption="128 CLK" name="128CLK" value="0x03"/>
                <value caption="256 CLK" name="256CLK" value="0x04"/>
                <value caption="512 CLK" name="512CLK" value="0x05"/>
                <value caption="1024 CLK" name="1024CLK" value="0x06"/>
                <value caption="2048 CLK" name="2048CLK" value="0x07"/>
                <value caption="4096 CLK" name="4096CLK" value="0x08"/>
                <value caption="8192 CLK" name="8192CLK" value="0x09"/>
                <value caption="16384 CLK" name="16384CLK" value="0x0A"/>
                <value caption="32768 CLK" name="32768CLK" value="0x0B"/>
                <value caption="65536 CLK" name="65536CLK" value="0x0C"/>
                <value caption="Auto refresh OFF" name="OFF" value="0x0F"/>
            </value-group>
        </module>
        <module name="RTC" id="I6093" caption="Real-Time Counter">
            <register-group caption="Real-Time Counter" name="RTC" size="14">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Prescaling Factor" mask="0x07" name="PRESCALER" values="RTC_PRESCALER"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Synchronization Busy Flag" mask="0x01" name="SYNCBUSY"/>
                </register>
                <register caption="Interrupt Control Register" name="INTCTRL" offset="0x02" size="1">
                    <bitfield caption="Compare Match Interrupt Level" mask="0x0C" name="COMPINTLVL"
                              values="RTC_COMPINTLVL"/>
                    <bitfield caption="Overflow Interrupt Level" mask="0x03" name="OVFINTLVL" values="RTC_OVFINTLVL"/>
                </register>
                <register caption="Interrupt Flags" name="INTFLAGS" offset="0x03" size="1">
                    <bitfield caption="Compare Match Interrupt Flag" mask="0x02" name="COMPIF"/>
                    <bitfield caption="Overflow Interrupt Flag" mask="0x01" name="OVFIF"/>
                </register>
                <register caption="Temporary register" name="TEMP" offset="0x04" size="1"/>
                <register caption="Count Register" name="CNT" offset="0x08" size="2"/>
                <register caption="Period Register" name="PER" offset="0x0A" size="2"/>
                <register caption="Compare Register" name="COMP" offset="0x0C" size="2"/>
            </register-group>
            <value-group caption="Prescaler Factor" name="RTC_PRESCALER">
                <value caption="RTC Off" name="OFF" value="0x00"/>
                <value caption="RTC Clock" name="DIV1" value="0x01"/>
                <value caption="RTC Clock / 2" name="DIV2" value="0x02"/>
                <value caption="RTC Clock / 8" name="DIV8" value="0x03"/>
                <value caption="RTC Clock / 16" name="DIV16" value="0x04"/>
                <value caption="RTC Clock / 64" name="DIV64" value="0x05"/>
                <value caption="RTC Clock / 256" name="DIV256" value="0x06"/>
                <value caption="RTC Clock / 1024" name="DIV1024" value="0x07"/>
            </value-group>
            <value-group caption="Compare Interrupt level" name="RTC_COMPINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Overflow Interrupt level" name="RTC_OVFINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="RTC">
                <interrupt index="0" name="OVF" caption="Overflow Interrupt"/>
                <interrupt index="1" name="COMP" caption="Compare Interrupt"/>
            </interrupt-group>
        </module>
