bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128A1.xml
            <value-group caption="SPI Mode" name="SPI_MODE">
                <value caption="SPI Mode 0" name="0" value="0x00"/>
                <value caption="SPI Mode 1" name="1" value="0x01"/>
                <value caption="SPI Mode 2" name="2" value="0x02"/>
                <value caption="SPI Mode 3" name="3" value="0x03"/>
            </value-group>
            <value-group caption="Prescaler setting" name="SPI_PRESCALER">
                <value caption="System Clock / 4" name="DIV4" value="0x00"/>
                <value caption="System Clock / 16" name="DIV16" value="0x01"/>
                <value caption="System Clock / 64" name="DIV64" value="0x02"/>
                <value caption="System Clock / 128" name="DIV128" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="SPI_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="SPI">
                <interrupt index="0" name="INT" caption="SPI Interrupt"/>
            </interrupt-group>
        </module>
        <module name="IRCOM" id="I6090" caption="IR Communication Module">
            <register-group caption="IR Communication Module" name="IRCOM" size="3">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Event Channel Select" mask="0x0F" name="EVSEL" values="IRDA_EVSEL"/>
                </register>
                <register caption="IrDA Transmitter Pulse Length Control Register" name="TXPLCTRL" offset="0x01"
                          size="1"/>
                <register caption="IrDA Receiver Pulse Length Control Register" name="RXPLCTRL" offset="0x02" size="1"/>
            </register-group>
            <value-group caption="Event channel selection" name="IRDA_EVSEL">
                <value caption="No Event Source" name="OFF" value="0x00"/>
                <value caption="Event Channel 0" name="0" value="0x08"/>
                <value caption="Event Channel 1" name="1" value="0x09"/>
                <value caption="Event Channel 2" name="2" value="0x0A"/>
                <value caption="Event Channel 3" name="3" value="0x0B"/>
                <value caption="Event Channel 4" name="4" value="0x0C"/>
                <value caption="Event Channel 5" name="5" value="0x0D"/>
                <value caption="Event Channel 6" name="6" value="0x0E"/>
                <value caption="Event Channel 7" name="7" value="0x0F"/>
            </value-group>
        </module>
        <module name="AES" id="I6096" caption="AES Module">
            <register-group caption="AES Module" name="AES" size="5">
                <register caption="AES Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Start/Run" mask="0x80" name="START"/>
                    <bitfield caption="Auto Start Trigger" mask="0x40" name="AUTO"/>
                    <bitfield caption="AES Software Reset" mask="0x20" name="RESET"/>
                    <bitfield caption="Decryption / Direction" mask="0x10" name="DECRYPT"/>
                    <bitfield caption="State XOR Load Enable" mask="0x04" name="XOR"/>
                </register>
                <register caption="AES Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="AES Error" mask="0x80" name="ERROR"/>
                    <bitfield caption="State Ready Interrupt Flag" mask="0x01" name="SRIF"/>
                </register>
                <register caption="AES State Register" name="STATE" offset="0x02" size="1"/>
                <register caption="AES Key Register" name="KEY" offset="0x03" size="1"/>
                <register caption="AES Interrupt Control Register" name="INTCTRL" offset="0x04" size="1">
                    <bitfield caption="Interrupt level" mask="0x03" name="INTLVL" values="AES_INTLVL"/>
                </register>
            </register-group>
            <value-group caption="Interrupt level" name="AES_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="AES">
                <interrupt index="0" name="INT" caption="AES Interrupt"/>
            </interrupt-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="TQFP100">
            <pin pad="PA6" position="1"/>
            <pin pad="PA7" position="2"/>
            <pin pad="GND" position="3"/>
            <pin pad="AVCC" position="4"/>
            <pin pad="PB0" position="5"/>
            <pin pad="PB1" position="6"/>
            <pin pad="PB2" position="7"/>
            <pin pad="PB3" position="8"/>
            <pin pad="PB4" position="9"/>
            <pin pad="PB5" position="10"/>
            <pin pad="PB6" position="11"/>
            <pin pad="PB7" position="12"/>
            <pin pad="GND" position="13"/>
            <pin pad="VCC" position="14"/>
            <pin pad="PC0" position="15"/>
            <pin pad="PC1" position="16"/>
            <pin pad="PC2" position="17"/>
            <pin pad="PC3" position="18"/>
            <pin pad="PC4" position="19"/>
            <pin pad="PC5" position="20"/>
            <pin pad="PC6" position="21"/>
            <pin pad="PC7" position="22"/>
            <pin pad="GND" position="23"/>
            <pin pad="VCC" position="24"/>
            <pin pad="PD0" position="25"/>
            <pin pad="PD1" position="26"/>
            <pin pad="PD2" position="27"/>
            <pin pad="PD3" position="28"/>
            <pin pad="PD4" position="29"/>
            <pin pad="PD5" position="30"/>
            <pin pad="PD6" position="31"/>
            <pin pad="PD7" position="32"/>
            <pin pad="GND" position="33"/>
            <pin pad="VCC" position="34"/>
            <pin pad="PE0" position="35"/>
            <pin pad="PE1" position="36"/>
            <pin pad="PE2" position="37"/>
            <pin pad="PE3" position="38"/>
            <pin pad="PE4" position="39"/>
            <pin pad="PE5" position="40"/>
            <pin pad="PE6" position="41"/>
            <pin pad="PE7" position="42"/>
            <pin pad="GND" position="43"/>
            <pin pad="VCC" position="44"/>
            <pin pad="PF0" position="45"/>
            <pin pad="PF1" position="46"/>
            <pin pad="PF2" position="47"/>
            <pin pad="PF3" position="48"/>
            <pin pad="PF4" position="49"/>
            <pin pad="PF5" position="50"/>
            <pin pad="PF6" position="51"/>
            <pin pad="PF7" position="52"/>
            <pin pad="GND" position="53"/>
            <pin pad="VCC" position="54"/>
            <pin pad="PH0" position="55"/>
            <pin pad="PH1" position="56"/>
            <pin pad="PH2" position="57"/>
            <pin pad="PH3" position="58"/>
            <pin pad="PH4" position="59"/>
            <pin pad="PH5" position="60"/>
            <pin pad="PH6" position="61"/>
            <pin pad="PH7" position="62"/>
            <pin pad="GND" position="63"/>
            <pin pad="VCC" position="64"/>
            <pin pad="PJ0" position="65"/>
            <pin pad="PJ1" position="66"/>
            <pin pad="PJ2" position="67"/>
            <pin pad="PJ3" position="68"/>
            <pin pad="PJ4" position="69"/>
            <pin pad="PJ5" position="70"/>
            <pin pad="PJ6" position="71"/>
            <pin pad="PJ7" position="72"/>
            <pin pad="GND" position="73"/>
            <pin pad="VCC" position="74"/>
            <pin pad="PK0" position="75"/>
            <pin pad="PK1" position="76"/>
            <pin pad="PK2" position="77"/>
            <pin pad="PK3" position="78"/>
            <pin pad="PK4" position="79"/>
            <pin pad="PK5" position="80"/>
            <pin pad="PK6" position="81"/>
            <pin pad="PK7" position="82"/>
            <pin pad="VCC" position="83"/>
            <pin pad="GND" position="84"/>
            <pin pad="PQ0" position="85"/>
            <pin pad="PQ1" position="86"/>
            <pin pad="PQ2" position="87"/>
            <pin pad="PQ3" position="88"/>
            <pin pad="PDI" position="89"/>
            <pin pad="RESET" position="90"/>
            <pin pad="PR0" position="91"/>
            <pin pad="PR1" position="92"/>
            <pin pad="GND" position="93"/>
            <pin pad="AVCC" position="94"/>
            <pin pad="PA0" position="95"/>
            <pin pad="PA1" position="96"/>
            <pin pad="PA2" position="97"/>
            <pin pad="PA3" position="98"/>
            <pin pad="PA4" position="99"/>
            <pin pad="PA5" position="100"/>
        </pinout>
        <pinout name="BGA100">
            <pin pad="PK0" position="A1"/>
            <pin pad="VCC" position="A2"/>
            <pin pad="GND" position="A3"/>
            <pin pad="PJ3" position="A4"/>
            <pin pad="VCC" position="A5"/>
            <pin pad="GND" position="A6"/>
            <pin pad="PH1" position="A7"/>
            <pin pad="GND" position="A8"/>
            <pin pad="VCC" position="A9"/>
            <pin pad="PF7" position="A10"/>
            <pin pad="PK3" position="B1"/>
            <pin pad="PK2" position="B2"/>
            <pin pad="PK1" position="B3"/>
            <pin pad="PJ4" position="B4"/>
            <pin pad="PH7" position="B5"/>
            <pin pad="PH4" position="B6"/>
            <pin pad="PH2" position="B7"/>
            <pin pad="PH0" position="B8"/>
            <pin pad="PF6" position="B9"/>
            <pin pad="PF5" position="B10"/>
            <pin pad="VCC" position="C1"/>
            <pin pad="PK5" position="C2"/>
            <pin pad="PK4" position="C3"/>
            <pin pad="PJ5" position="C4"/>
            <pin pad="PJ0" position="C5"/>
            <pin pad="PH5" position="C6"/>
            <pin pad="PH3" position="C7"/>
            <pin pad="PF2" position="C8"/>
            <pin pad="PF3" position="C9"/>
            <pin pad="VCC" position="C10"/>
            <pin pad="GND" position="D1"/>
            <pin pad="PK6" position="D2"/>
            <pin pad="PK7" position="D3"/>
            <pin pad="PJ6" position="D4"/>
            <pin pad="PJ1" position="D5"/>
            <pin pad="PH6" position="D6"/>
            <pin pad="PF0" position="D7"/>
            <pin pad="PF1" position="D8"/>
            <pin pad="PF4" position="D9"/>
            <pin pad="GND" position="D10"/>
            <pin pad="PQ0" position="E1"/>
            <pin pad="PQ1" position="E2"/>
            <pin pad="PQ2" position="E3"/>
            <pin pad="PJ7" position="E4"/>
            <pin pad="PJ2" position="E5"/>
            <pin pad="PE7" position="E6"/>
            <pin pad="PE6" position="E7"/>
            <pin pad="PE5" position="E8"/>
            <pin pad="PE4" position="E9"/>
            <pin pad="PE3" position="E10"/>
            <pin pad="PR1" position="F1"/>
            <pin pad="PR0" position="F2"/>
            <pin pad="RESET" position="F3"/>
            <pin pad="PDI_DATA" position="F4"/>
            <pin pad="PQ3" position="F5"/>
            <pin pad="PC2" position="F6"/>
            <pin pad="PE2" position="F7"/>
            <pin pad="PE1" position="F8"/>
            <pin pad="PE0" position="F9"/>
            <pin pad="VCC" position="F10"/>
            <pin pad="GND" position="G1"/>
            <pin pad="PA1" position="G2"/>
            <pin pad="PA4" position="G3"/>
            <pin pad="PB3" position="G4"/>
            <pin pad="PB4" position="G5"/>
            <pin pad="PC1" position="G6"/>
            <pin pad="PC6" position="G7"/>
            <pin pad="PD7" position="G8"/>
            <pin pad="PD6" position="G9"/>
            <pin pad="GND" position="G10"/>
            <pin pad="AVCC" position="H1"/>
            <pin pad="PA2" position="H2"/>
            <pin pad="PA5" position="H3"/>
            <pin pad="PB2" position="H4"/>
            <pin pad="PB5" position="H5"/>
            <pin pad="PC0" position="H6"/>
            <pin pad="PC5" position="H7"/>
            <pin pad="PD5" position="H8"/>
            <pin pad="PD4" position="H9"/>
            <pin pad="PD3" position="H10"/>
            <pin pad="PA0" position="J1"/>
            <pin pad="PA3" position="J2"/>
            <pin pad="PB0" position="J3"/>
            <pin pad="PB1" position="J4"/>
            <pin pad="PB6" position="J5"/>
            <pin pad="PC3" position="J6"/>
            <pin pad="PC4" position="J7"/>
            <pin pad="PC7" position="J8"/>
            <pin pad="PD2" position="J9"/>
            <pin pad="PD1" position="J10"/>
            <pin pad="PA6" position="K1"/>
            <pin pad="PA7" position="K2"/>
            <pin pad="GND" position="K3"/>
            <pin pad="AVCC" position="K4"/>
            <pin pad="PB7" position="K5"/>
            <pin pad="VCC " position="K6"/>
            <pin pad="GND" position="K7"/>
            <pin pad="VCC" position="K8"/>
            <pin pad="GND" position="K9"/>
            <pin pad="PD0" position="K10"/>
        </pinout>
    </pinouts>
</target-description-file>
